{
  "version": "0.1.0",
  "model_type": "gemma3_text",
  "quantization": "q4f16_1",
  "model_config": {
    "text_config": {
      "hidden_size": 640,
      "intermediate_size": 2048,
      "num_hidden_layers": 18,
      "attention_bias": false,
      "num_attention_heads": 4,
      "num_key_value_heads": 1,
      "head_dim": 256,
      "rms_norm_eps": 1e-06,
      "hidden_activation": "gelu_pytorch_tanh",
      "position_embedding_base": 1000000.0,
      "rope_scaling": null,
      "context_window_size": 8192,
      "prefill_chunk_size": 8192,
      "query_pre_attn_scalar": 256,
      "sliding_window_size": 512,
      "kwargs": {
        "_sliding_window_pattern": 6,
        "architectures": [
          "Gemma3ForCausalLM"
        ],
        "attention_dropout": 0.0,
        "attn_logit_softcapping": null,
        "bos_token_id": 2,
        "dtype": "bfloat16",
        "eos_token_id": [
          1,
          50
        ],
        "final_logit_softcapping": null,
        "initializer_range": 0.02,
        "layer_types": [
          "sliding_attention",
          "sliding_attention",
          "sliding_attention",
          "sliding_attention",
          "sliding_attention",
          "full_attention",
          "sliding_attention",
          "sliding_attention",
          "sliding_attention",
          "sliding_attention",
          "sliding_attention",
          "full_attention",
          "sliding_attention",
          "sliding_attention",
          "sliding_attention",
          "sliding_attention",
          "sliding_attention",
          "full_attention"
        ],
        "max_position_embeddings": 32768,
        "model_type": "gemma3_text",
        "pad_token_id": 0,
        "rope_local_base_freq": 10000.0,
        "sliding_window": 512,
        "transformers_version": "4.57.3",
        "use_bidirectional_attention": false,
        "use_cache": true
      }
    },
    "vocab_size": 262144,
    "tensor_parallel_shards": 1,
    "max_batch_size": 128,
    "context_window_size": 8192,
    "sliding_window_size": 512,
    "prefill_chunk_size": 8192,
    "is_text_model": true
  },
  "vocab_size": 262144,
  "context_window_size": 8192,
  "sliding_window_size": 512,
  "prefill_chunk_size": 8192,
  "attention_sink_size": -1,
  "tensor_parallel_shards": 1,
  "pipeline_parallel_stages": 1,
  "active_vocab_size": 262146,
  "temperature": 1.0,
  "presence_penalty": 0.0,
  "frequency_penalty": 0.0,
  "repetition_penalty": 1.0,
  "top_p": 0.95,
  "tokenizer_files": [
    "tokenizer.model",
    "tokenizer.json",
    "added_tokens.json",
    "tokenizer_config.json"
  ],
  "tokenizer_info": {
    "token_postproc_method": "byte_fallback",
    "prepend_space_in_encode": false,
    "strip_space_in_decode": false
  },
  "conv_template": {
    "name": "gemma3_instruction",
    "system_template": "<start_of_turn>developer\n{system_message}",
    "system_message": "",
    "system_prefix_token_ids": [
      2
    ],
    "add_role_after_system_message": true,
    "roles": {
      "user": "<start_of_turn>user",
      "assistant": "<start_of_turn>model"
    },
    "role_templates": {
      "user": "{user_message}",
      "assistant": "{assistant_message}",
      "tool": "{tool_message}"
    },
    "messages": [],
    "seps": [
      "<end_of_turn>\n"
    ],
    "role_content_sep": "\n",
    "role_empty_sep": "\n",
    "stop_str": [
      "<end_of_turn>"
    ],
    "stop_token_ids": [
      1,
      106
    ],
    "function_string": "",
    "use_function_calling": false
  },
  "pad_token_id": 0,
  "bos_token_id": 2,
  "eos_token_id": [
    1,
    50,
    106
  ]
}